#### Feature Engineering

FEATURE ENGINEERING
* it is the process of tranforming raw data into features that make machine    learning algorithms work better.
* to improve performance of ML models
* it can improve quality and relevance of features

Catagorical Features

Groups of data
  * will include Binary Features (0 and 1)
  * sex - M F
  * Survived - Yes NO
  * Bool data type
  * Category data type -
  * Ordinal data type - you can set up a scale in the categories - Small       Medium Large - COld warm hot
  * small height medium height large height

Numerical Features

* where there are numbers
* will include float and integers both
* continous values,
* grouping up will not make much sense (unless doing clustering)

- Differnt data types in pandas data

In [2]:
import pandas as pd
import seaborn as sns
import numpy as np

In [2]:
iris=sns.load_dataset('iris')

iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [3]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

**Can you check for titanic?**
  * how many categorical features?
  * how many numerical features

In [6]:
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [4]:
import seaborn as sns
import pandas as pd

penguins = sns.load_dataset("penguins")
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [5]:
penguins.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

* Encoding

In [6]:
# label encoding 
# column that you can encode

penguins['species'].unique()

#  {  }

species_codes = {
    'Adelie': 0,
    'Chinstrap': 1,
    'Gentoo': 2
}

penguins['species_encoded'] = penguins['species'].map(species_codes) 

penguins.sample(10)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,species_encoded
212,Chinstrap,Dream,51.9,19.5,206.0,3950.0,Male,1
38,Adelie,Dream,37.6,19.3,181.0,3300.0,Female,0
295,Gentoo,Biscoe,48.6,16.0,230.0,5800.0,Male,2
54,Adelie,Biscoe,34.5,18.1,187.0,2900.0,Female,0
149,Adelie,Dream,37.8,18.1,193.0,3750.0,Male,0
61,Adelie,Biscoe,41.3,21.1,195.0,4400.0,Male,0
81,Adelie,Torgersen,42.9,17.6,196.0,4700.0,Male,0
218,Chinstrap,Dream,50.8,19.0,210.0,4100.0,Male,1
333,Gentoo,Biscoe,51.5,16.3,230.0,5500.0,Male,2
253,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,Male,2

In [15]:
# pandas map
import pandas as pd

s = pd.Series(['cat', 'cow', 'dog'])

s2 = s.map({'cat': 'kitten', 'cow': 'calf'})
print(s2)

0    kitten
1      calf
2       NaN
dtype: object

**copy and view**
df
df2 = df.copy()
df2.dropna

In [7]:
# inbuilt map function of python
words = ["apple", "banana", "cherry"]
lengths = map(len, words)
list(lengths)

[5, 6, 6]

In [8]:
# factorize
# species still contains the specie names

# factorize will take the column and assigns numbers to the new groups
x, y = pd.factorize(penguins['species'])

penguins [ 'species_factorized' ] = x
penguins

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,species_encoded,species_factorized
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,0,0
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,0,0
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,0,0
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,0,0
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,0,0
...,...,...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,2,2
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female,2,2
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male,2,2
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female,2,2
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male,2,2

In [9]:
factors = pd.factorize(penguins['species'])
penguins [ 'species_factorized' ] = factors[0]
penguins [[ 'species','species_factorized' ]]

    species  species_factorized
0    Adelie                   0
1    Adelie                   0
2    Adelie                   0
3    Adelie                   0
4    Adelie                   0
..      ...                 ...
339  Gentoo                   2
340  Gentoo                   2
341  Gentoo                   2
342  Gentoo                   2
343  Gentoo                   2

[344 rows x 2 columns]

In [16]:
penguins['island'].unique()

array(['Torgersen', 'Biscoe', 'Dream'], dtype=object)

In [24]:
penguins[penguins['island'] == 'Dream'][['island', 'island_encoded']].head()

   island  island_encoded
30  Dream               2
31  Dream               2
32  Dream               2
33  Dream               2
34  Dream               2

In [11]:
df = penguins.copy()

df['species'] = df['species'].astype('category')

df['species_cat_encoded'] = df['species'].cat.codes
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,species_encoded,species_factorized,species_cat_encoded
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,0,0,0
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,0,0,0
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,0,0,0
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,0,0,0
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,0,0,0
...,...,...,...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,2,2,2
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female,2,2,2
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male,2,2,2
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female,2,2,2
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male,2,2,2

In [17]:
island_codes = {
    'Torgersen': 0,
    'Biscoe': 1,
    'Dream': 2
}

In [22]:
penguins[['island', 'island_encoded']].value_counts()

island     island_encoded
Biscoe     1                 168
Dream      2                 124
Torgersen  0                  52
Name: count, dtype: int64

In [25]:
penguins.groupby('island')['island_encoded'].unique()

island
Biscoe       [1]
Dream        [2]
Torgersen    [0]
Name: island_encoded, dtype: object

In [26]:
penguins['species']

0      Adelie
1      Adelie
2      Adelie
3      Adelie
4      Adelie
        ...
339    Gentoo
340    Gentoo
341    Gentoo
342    Gentoo
343    Gentoo
Name: species, Length: 344, dtype: object

In [32]:
codes, uniques = pd.factorize(penguins['species'])

penguins['species_factorized'] = codes

In [33]:
penguins[['species', 'species_factorized']].sample(10)

       species  species_factorized
147     Adelie                   0
226     Gentoo                   2
113     Adelie                   0
263     Gentoo                   2
110     Adelie                   0
156  Chinstrap                   1
198  Chinstrap                   1
186  Chinstrap                   1
55      Adelie                   0
111     Adelie                   0

In [36]:
penguins.columns

Index(['species', 'island', 'bill_length_mm', 'bill_depth_mm',
       'flipper_length_mm', 'body_mass_g', 'sex', 'island_encoded',
       'species_factorized'],
      dtype='object')

In [38]:
df = penguins.copy()

df['species'] = df['species'].astype('category')
df['species_cat_encoded'] = df['species'].cat.codes

In [44]:
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,island_encoded,species_factorized,species_cat_encoded
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,0,0,0
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,0,0,0
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,0,0,0
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,0,0,0
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,0,0,0

## Task exercise
* apply the three method to island column
* manually applying label codes
* using the factorize method
* using the category
* using the label encoder method

In [45]:
#1️⃣ Manual label encoding (mapping dictionary)
island_map = {
    'Torgersen': 0,
    'Biscoe': 1,
    'Dream': 2
}

df['island_manual_encoded'] = df['island'].map(island_map)

In [46]:
df[['island', 'island_manual_encoded']].head()

      island  island_manual_encoded
0  Torgersen                      0
1  Torgersen                      0
2  Torgersen                      0
3  Torgersen                      0
4  Torgersen                      0

In [55]:
#2️⃣ Encoding using factorize()
df['island_factorized'] = pd.factorize(df['island'])[0]
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,island_encoded,species_factorized,species_cat_encoded,island_manual_encoded,island_factorized,island_category_encoded
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,0,0,0,0,0,0
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,0,0,0,0,0,0
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,0,0,0,0,0,0
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,0,0,0,0,0,0
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,1,2,2,1,1,1
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female,1,2,2,1,1,1
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male,1,2,2,1,1,1
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female,1,2,2,1,1,1
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male,1,2,2,1,1,1

In [57]:
#3️⃣ Encoding using category
df['island'] = df['island'].astype('category')
df['island_category_encoded'] = df['island'].cat.codes

In [50]:
df[['island', 'island_category_encoded']].head()

      island  island_category_encoded
0  Torgersen                        2
1  Torgersen                        2
2  Torgersen                        2
3  Torgersen                        2
4  Torgersen                        2

In [51]:
#Compare all 3 side-by-side
df[['island',
    'island_manual_encoded',
    'island_factorized',
    'island_category_encoded']].head(10)

,island,island_manual_encoded,island_factorized,island_category_encoded
0,Torgersen,0,0,2
1,Torgersen,0,0,2
2,Torgersen,0,0,2
3,Torgersen,0,0,2
4,Torgersen,0,0,2
5,Torgersen,0,0,2
6,Torgersen,0,0,2
7,Torgersen,0,0,2
8,Torgersen,0,0,2
9,Torgersen,0,0,2

* label Encoding using sklearn

In [59]:
from sklearn.preprocessing import LabelEncoder

#create LabelEncoder instance
encoder = LabelEncoder()

df['species_sklearn_le'] = encoder.fit_transform(df['species'])
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,island_encoded,species_factorized,species_cat_encoded,island_manual_encoded,island_factorized,island_category_encoded,species_sklearn_le
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,0,0,0,0,0,0,0
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,0,0,0,0,0,0,0
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,0,0,0,0,0,0,0
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,0,0,0,0,0,0,0
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,1,2,2,1,1,1,2
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female,1,2,2,1,1,1,2
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male,1,2,2,1,1,1,2
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female,1,2,2,1,1,1,2
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male,1,2,2,1,1,1,2